<?php
$rank = array(
    1 => '屌丝',
    2 => '老板',
    3 => '富人',
    4 => '富豪',
    5 => '大富豪',
    6 => '福布斯',
);
$rank_range =  array(
    1 => array(1,50),
    2 => array(51,100),
    3 => array(101,200),
    4 => array(201,500),
    5 => array(501,3000),
    6 => array(3001,6000000000000)
);
//玩游戏奖励百分比
$rank_scale = array(
  1 => 0.2,
  2 => 0.2,
  3 => 0.25,
  4 => 0.3,
  5 => 0.4,
  6 => 0.5,
);
//用户等级
$user_range = array(
    0 => '普通用户',
    1 => '积分VIP用户',
    2 => '年VIP用户',
    3 => '永久VIP用户',
);
$user_rank_range =  array(
    1 => array(1,2,3,4),
    2 => array(5),
    3 => array(6)
);
//炸年兽抢装备
$beast_zhuangbei = array(
    1=>'步步高升',2=>'财源滚滚',3=>'福星高照',4=>'鸿运当头',5=>'旺桃花运',
);
//闹元宵猜猜
$yuanxiao_jp_index = array(1,2,3,4,5,6);
$yuanxiao_jp = array(1=>'',2=>'10个色币',3=>'爱奇艺月会员',4=>'保温杯',5=>'巧克力',6=>'VR眼镜');
//游戏任务配置
$task_type = array(1=>'余额',2=>'存款',3=>'流水',);
$task_sign = array('>'=>'大于','>='=>'大于或等于','<'=>'小于','<='=>'小于或等于','=='=>'等于');
$task_join = array('&&'=>'并且','||'=>'或');